package com.example.delta.init

object IranianLocations {
    val provinces = mapOf(
        "آذربایجان شرقی" to listOf("مرکزی", "شمالی", "جنوبی", "غربی", "شرقی"),
        "آذربایجان غربی" to listOf("مرکزی", "شمالی", "جنوبی", "شرقی", "غربی"),
        "اردبیل" to listOf("اردبیل", "مشگین شهر", "خلخال"),
        "اصفهان" to listOf("مرکزی", "سمیرم", "نجف آباد"),
        "ایلام" to listOf("ایلام", "دهلران", "دره شهر"),
        "بوشهر" to listOf("بوشهر", "برازجان", "بندر گناوه"),
        "تهران" to listOf("مرکزی", "شمالی", "جنوبی", "غربی", "شرقی"),
        "چهارمحال و بختیاری" to listOf("شهرکرد", "بروجن", "لردگان"),
        "خراسان جنوبی" to listOf("بیرجند", "قائن", "طبس"),
        "خراسان رضوی" to listOf("مشهد", "نیشابور", "سبزوار"),
        "خراسان شمالی" to listOf("بجنورد", "شیروان", "اسفراین"),
        "خوزستان" to listOf("اهواز", "دزفول", "آبادان"),
        "زنجان" to listOf("زنجان", "ابهر", "خدابنده"),
        "سمنان" to listOf("سمنان", "دامغان", "شاهرود"),
        "سیستان و بلوچستان" to listOf("زاهدان", "زابل", "ایرانشهر"),
        "فارس" to listOf("شیراز", "مرودشت", "کازرون"),
        "قزوین" to listOf("قزوین", "تاکستان", "آبیک"),
        "قم" to listOf("قم", "جعفریه"),
        "کردستان" to listOf("سنندج", "سقز", "مریوان"),
        "کرمان" to listOf("کرمان", "سیرجان", "رفسنجان"),
        "کرمانشاه" to listOf("کرمانشاه", "اسلام آباد غرب", "پاوه"),
        "کهگیلویه و بویراحمد" to listOf("یاسوج", "دهدشت", "لیکک"),
        "گلستان" to listOf("گرگان", "گنبد کاووس", "آق قلا"),
        "گیلان" to listOf("رشت", "لاهیجان", "لنگرود"),
        "لرستان" to listOf("خرم آباد", "بروجرد", "دورود"),
        "مازندران" to listOf("ساری", "بابل", "آمل"),
        "مرکزی" to listOf("اراک", "ساوه", "خمین"),
        "هرمزگان" to listOf("بندرعباس", "بندر لنگه", "میناب"),
        "همدان" to listOf("همدان", "ملایر", "نهاوند"),
        "یزد" to listOf("یزد", "اردکان", "میبد")
    )
}


